articles/learningbyaccumulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning by Accumulation</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Learning by Accumulation</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#learning-by-accumulation">Learning By Accumulation</a></li>
</ul>
</div>
</div>

<div id="outline-container-learning-by-accumulation" class="outline-1">
<h1 id="learning-by-accumulation">Learning By Accumulation</h1>
<div class="outline-text-1" id="text-learning-by-accumulation">
<p>
This is a sort of meta-skill I developed during my college years that
has served me extremely well up to now. Before I started learning to do
this, I would think of project ideas and more or less immediately
discard them, since I didn't yet have the relevant skillset to
accomplish it and felt that acquiring that skillset would be too much of
an investment. Something like "make a machine learning classifier for
seeding tournament brackets" felt impossible to me, since I was under
the erroneous assumption that I would need to learn mountains of machine
learning to "become worthy" of doing a project on machine learning. In
short, I felt that I didn't deserve to use tools that I had not yet
mastered completely.
</p>

<p>
Luckily, I realized, that's not really the case! Becoming functional and
mediocre at pretty much anything is within reach for pretty much anyone,
and if you're doing it for the sake of a project and not a career then
it's often practical to only acquire what you need to accomplish your
goal. This can often lead you to a more passionate interest in your
subject that you otherwise would have had (i.e. making something cool to
gauge your interest in a subject, then deciding that it was extremely
cool and learning more about it).
</p>

<p>
The nice thing about this is that your skillset and knowledge don't go
away after you finish your project. By doing many things, you learn to
do many things, and thereby gain access to even more things you wouldn't
have even thought of had you not done the first thing. As they say, once
you're given a hammer, nails start popping up all over the place.
</p>

<p>
It seems like a pretty obvious thing to say, but you won't believe how
often I see people place this sort of self-imposed barrier to action
upon themselves. People who show up to SSBM tournaments after spending a
year practicing by themselves, since they didn't feel "good enough to
play with real players", or people who refuse to do anything vaguely
math-related since they're afraid of numbers.
</p>

<p>
Also important to note is that learning in this way will often put you
face-to-face with failure. It's important to realize that this is okay!
Having consistent output is more important than making sure all your
output is good, since you have no obligation to share every single
failure you have. Trying something too hard and messing up still nets
you experience points in the real world, and as Neal Stephenson put it:
"hey, at least a wild-goose chase gives you some exercise."
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
